app/controllers/comments_controller.rb

INSERT INTO `comments` (`text`, `tweet_id`, `user_id`, `created_at`, `updated_at`) VALUES ('syasinn', 9, 1, '2018-04-26 07:51:02', '2018-04-26 07:51:02')
---
  def create
    # binding.pry
    @comment = Comment.create(text: comment_params[:text], tweet_id: comment_params[:tweet_id], user_id: current_user.id)