app/controllers/tweets_controller.rb

def index
  @tweets = Tweet.includes(:user).order("created_at DESC").page(params[:page]).per(5)
---
SELECT  `tweets`.* FROM `tweets`  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1)

def create
  Tweet.create(image: tweet_params[:image], text: tweet_params[:text], user_id: current_user.id)
---
INSERT INTO `tweets` (`name`, `image`, `text`, `user_id`, `created_at`, `updated_at`) VALUES ('hayasi', 'https://tech-master.s3.amazonaws.com/uploads/curriculums/images/Rails1-6/036.png', 'kakunin', 1, '2018-04-24 11:06:36', '2018-04-24 11:06:36')

def destroy
  tweet = Tweet.find(params[:id])
  tweet.destroy if tweet.user_id == current_user.id
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 7 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 7

def edit
  @tweet = Tweet.find(params[:id])
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 9 LIMIT 1

def update
tweet = Tweet.find(params[:id])
if tweet.user_id == current_user.id
  tweet.update(tweet_params)
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 9 LIMIT 1
UPDATE `tweets` SET `text` = '確認', `updated_at` = '2018-04-25 09:50:11' WHERE `tweets`.`id` = 9

def show
  @tweet = Tweet.find(params[:id])
  @comments = @tweet.comments.includes(:user)
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 9 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`tweet_id` = 8